app/Http/Controllers/Admin/NewsController.php

    public function create(Request $request){

        // 以下を追記
        // Varidationを行う
        $this->validate($request, News::$rules);

        $news = new News;
        $form = $request->all();

        // フォームから画像が送信されてきたら、保存して、$news->image_path に画像のパスを保存する
        if (isset($form['image'])) {
            $path = $request->file('image')->store('public/image');
            $news->image_path = basename($path);
        } else {
            $news->image_path = null;
        }

        // フォームから送信されてきた_tokenを削除する
        unset($form['_token']);
        // フォームから送信されてきたimageを削除する
        unset($form['image']);

        // データベースに保存する
        $news->fill($form);
        $news->save();
---
insert into `news` (`image_path`, `title`, `body`, `updated_at`, `created_at`) values ('3fCue9UpXAqdAqZb6h5TcvpuB85RpPIUXWylUt46.jpeg', 'テスト', '東京オリンピック', '2019-08-01 23:44:48', '2019-08-01 23:44:48')